app/Controllers/Admin/RekapBulanan.php

SELECT `pegawai`.`nip` as `nip_pegawai`, `pegawai`.`nama` as `nama_pegawai`, `presensi`.`jam_masuk`, `presensi`.`jam_keluar`
FROM `presensi`
LEFT JOIN `pegawai` ON `pegawai`.`id` = `presensi`.`id_pegawai`
---
    public function index()
    {
        $PresensiModel = new PresensiModel();
        $PegawaiModel = new PegawaiModel();

        $query = $PresensiModel->select('
                pegawai.nip as nip_pegawai,
                pegawai.nama as nama_pegawai,
                presensi.jam_masuk,
                presensi.jam_keluar')
            ->join('pegawai', 'pegawai.id = presensi.id_pegawai', 'left')
            ->get();