app/Controllers/Pegawai/Home.php

    public function index()
    {
        $lokasi_presensi = new LokasiPresensiModel();
        $pegawaiModel = new PegawaiModel();
        $id_pegawai = session()->get('id_pegawai');
        $presensi_model = new PresensiModel();
        $pegawai = $pegawaiModel->where('id', $id_pegawai)->first();

        $data = [
            'title' => session()->get('role_id') . ' Dashboard',
            'lokasi_presensi' => $lokasi_presensi->where('id', $pegawai['lokasi_presensi'])->first(),
            'cek_presensi' => $presensi_model->where('id_pegawai', $id_pegawai)->where('tanggal_masuk', date('Y-m-d'))->countAllResults(),
            'get_presensi' => $presensi_model->where('id_pegawai', $id_pegawai)->where('tanggal_masuk', date('Y-m-d'))->first() ?? 0
---
SELECT *
FROM `pegawai`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `lokasi_presensi`
WHERE `id` = '1'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `presensi`
WHERE `id_pegawai` = '2'
AND `tanggal_masuk` = '2024-07-24'
SELECT *
FROM `presensi`
WHERE `id_pegawai` = '2'
AND `tanggal_masuk` = '2024-07-24'
 LIMIT 1

    public function presensi_masuk_aksi()
    {
        $request = \Config\Services::request();
        $id_pegawai = $request->getPost('id_pegawai');
        $tanggal_masuk = $request->getPost('tanggal_masuk');
        $jam_masuk = $request->getPost('jam_masuk');

        $foto_masuk = $request->getPost('foto_masuk');
        $foto_masuk = str_replace('data:image/jpeg;base64,','', $foto_masuk);
        $foto_masuk = base64_decode($foto_masuk);

        $foto_dir = 'uploads/' . $id_pegawai . '_' . time() . '.jpg';
        $nama_foto = $id_pegawai . '_' . time() . '.jpg';
        file_put_contents($foto_dir, $foto_masuk);

        $presensi_model = new PresensiModel();
        $presensi_model->insert([
            'id_pegawai' => $id_pegawai,
            'jam_masuk' => $jam_masuk,
            'tanggal_masuk' => $tanggal_masuk,
            'foto_masuk' => $nama_foto
        ]);
---
INSERT INTO `presensi` (`id_pegawai`, `jam_masuk`, `tanggal_masuk`, `foto_masuk`) VALUES ('4', '15:34:19', '2024-07-24', '4_1721810076.jpg')