app/Controllers/User.php

    public function login_action()
    {
        $session = session();
        $userModel = new UserModel;
        $pegawaiModel = new PegawaiModel();
        $lokasi_presensi = new LokasiPresensiModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $cekUsername = $userModel->where('username', $username)->first();

        if ($cekUsername) {
            $password_db = $cekUsername['password'];
            $cekPassword = password_verify($password, $password_db);
            $cekPegawai = $pegawaiModel->where('id', $cekUsername['id_pegawai'])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'akmalazahwa'
 LIMIT 1
SELECT *
FROM `pegawai`
WHERE `id` = '1'
 LIMIT 1