app/Models/RekapHarianModel.php

SELECT `jam_masuk`, `jam_pulang`
FROM `lokasi_presensi`
WHERE `id` = '1'
---
    public function getBatasWaktu($id_lokasi)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('lokasi_presensi');
        $builder->select('jam_masuk, jam_pulang');
        $builder->where('id', $id_lokasi);
        $query = $builder->get();